In [1]:
import pandas as pd

In [2]:
loyalties_exchange = pd.read_csv("assets/SkyTeam-Exchange.card.csv", sep=",")
flight_exchange = pd.read_csv("assets/SkyTeam-Exchange.flight.csv", sep=",")
sit_exchange = pd.read_csv("assets/SkyTeam-Exchange.sit.csv", sep=",")

In [4]:
loyalties_exchange.head()

             id flight_id
0      sdf,d fg    AF1145
1   FB 18427809    AF1844
2  KE 993927664    AF4855
3  SU 789402704    AF4901
4  KE 352734424     AZ545

In [5]:
flight_exchange.head()

       id        date from  status   to
0  AF1145  2017-01-01  SVO  LANDED  CDG
1  AF1844  2017-01-01  SVO  LANDED  CDG
2  AF4855  2017-01-01  SVO  LANDED  CDG
3  AF4901  2017-01-01  SVO  LANDED  CDG
4   AZ545  2017-01-01  SVO  LANDED  FCO

In [6]:
sit_exchange.head()

        card_id class    fare
0  FB 520518073     Y  YRSTFN
1   FB 18427809     Y  YGRPZR
2  KE 993927664     Y  YRSTJQ
3  SU 789402704     Y  YGRPAT
4  KE 352734424     Y  YFLXKO

In [ ]:
exchange_merged = pd.merge(flight_exchange, loyalties_exchange, how='outer', left_on='id', right_on='flight_id')